In [2]:
import pandas as pd
from pprint import pprint

In [3]:
sdata = {'台北':[35000,60000,74000], '桃園':[71000,90000,120000], '台中':[16000,71000,90000], '高雄':[5000,34008,65000]}
pprint(sdata)

{'台中': [16000, 71000, 90000],
 '台北': [35000, 60000, 74000],
 '桃園': [71000, 90000, 120000],
 '高雄': [5000, 34008, 65000]}

In [5]:
df2 = pd.DataFrame(sdata)
df2

      台北      桃園     台中     高雄
0  35000   71000  16000   5000
1  60000   90000  71000  34008
2  74000  120000  90000  65000